app/views/repos/main.html.erb

SELECT  "users".* FROM "users" INNER JOIN "repos_users" ON "users"."id" = "repos_users"."user_id" WHERE "repos_users"."repo_id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["repo_id", 2], ["LIMIT", 1]]
---
<!--<h1>seed_size: <%#= @repo.seed_size.to_s %></h1>-->
<!--<h1>owner: <%#= @repo.users.first.username %></h1>-->