app/controllers/repos_controller.rb

  def get_sentence

    if $seed_status and $line_num >= $seed_line_total

      update_to_file
      $seed_status = false
      $line_num = 1
      $prev_line_num = 1
      $time = 1
      @repo.update(status, update_status)
---
UPDATE "repos" SET "status" = ?, "updated_at" = ? WHERE "repos"."id" = ?  [["status", "22 1 true 0 2544 0 84413 3"], ["updated_at", "2019-04-12 20:27:09.233612"], ["id", 28]]

  def update_to_file

    $cache[$name][0].each do |sentence|

      sentence.each do |line|

        system("sed", "-i", $prev_line_num.to_s+"s/^.*$/"+line+"/", $path+$sentence_path)
        $prev_line_num += 1
      end

      $prev_line_num += 1
    end

    $seed_status ? ($seed_line_annotated = $prev_line_num) : ($corpus_line_annotated = $prev_line_num)

    $cache[$name][0] = []
    $cache[$name][1] = [false, -999]

    @repo.update(status: update_status)
---
UPDATE "repos" SET "status" = ?, "updated_at" = ? WHERE "repos"."id" = ?  [["status", "70 3 true 0 2712 0 22567 3"], ["updated_at", "2019-04-13 00:33:10.555610"], ["id", 31]]

    def find_and_setup_repo
      @user = User.find_by_username(params[:username])
      ReposUser.where("user_id='"+@user.id.to_s+"'").find_each do |repo|
        Repo.where("id='"+repo.repo_id.to_s+"'").find_each do |re|
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "fengggg"], ["LIMIT", 1]]
SELECT  "repos_users".* FROM "repos_users" WHERE (repo_id='1' AND user_id='1') ORDER BY "repos_users"."id" ASC LIMIT ?  [["LIMIT", 1000]]
SELECT  "repos".* FROM "repos" WHERE (repo_name=repohahahaha) ORDER BY "repos"."id" ASC LIMIT ?  [["LIMIT", 1000]]