app/controllers/users_controller.rb

SELECT  "repos_users".* FROM "repos_users" WHERE (user_id='1') ORDER BY "repos_users"."id" ASC LIMIT ?  [["LIMIT", 1000]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "repos".* FROM "repos" INNER JOIN "repos_users" ON "repos"."id" = "repos_users"."repo_id" WHERE "repos_users"."user_id" = ? ORDER BY "repos"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def info
    @user_repo_array = []
    @user_repo_info = []
    @user_repo_path_no_slash = []

    ReposUser.where("user_id='"+@user.id.to_s+"'").find_each do |repo|

      Repo.where("id='"+repo.repo_id.to_s+"'").find_each do |re|

SELECT  "repos_users".* FROM "repos_users" WHERE (user_id='18') ORDER BY "repos_users"."id" ASC LIMIT ?  [["LIMIT", 1000]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "repos".* FROM "repos" INNER JOIN "repos_users" ON "repos"."id" = "repos_users"."repo_id" WHERE "repos_users"."user_id" = ?  [["user_id", 1]]
---
  def find_repo name

    ReposUser.where("user_id='" +@user.id.to_s+"'").find_each do |repo|
      Repo.where("id='"+repo.repo_id.to_s+"'").find_each do |re|

UPDATE "repos" SET "status" = ?, "updated_at" = ? WHERE "repos"."id" = ?  [["status", "1 1 true 0 3133 0 154268 1"], ["updated_at", "2019-04-12 19:44:43.329776"], ["id", 25]]
---
  def generate_seed

    info = JSON.parse(request.body.read)
    name = info["name"]


    re = find_repo name


    path = "HER-data/"+re.id.to_s+"_"+re.repo_name + "/"
    lg = re.language
    seed_size = re.seed_size.to_i

    Dir.chdir path

    system("sh", "Scripts/prepare_original_texts.sh","Scripts/preprocess.py", lg, "2>", "log.txt")
    system("python","Scripts/rankSents.py","-corpus","Data/Prepared/fullCorpus.txt","-sort_method","random_seed",
           "-topXsents",seed_size.to_s,"-output","Data/Splits/fullCorpus.seed-"+seed_size.to_s, "-annotate", "True")

    out = `wc -l Data/Splits/*`


    status = re.status.split
    update = status[0]+" "+status[1]+" "+status[2]+" "+status[3]+" "+out.split[0]+" "+status[5]+" "+out.split[2]+" "+status[7]

    re.update(status: update)

INSERT INTO "repos" ("repo_name", "seed_size", "language", "entities", "sort_method", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "repos".* FROM "repos" ORDER BY "repos"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def add_repo

    repo_info = request.body.read

    repo_info = JSON.parse(repo_info)


    repo_name = repo_info["repo_name"]
    language = repo_info["language"]
    seed_size = repo_info["seed_size"]
    sort_method = repo_info["sort_method"]
    entities = repo_info["entities"]


    Repo.new(:repo_name => repo_name,
             :language => language,
             :seed_size => seed_size.to_i,
             :sort_method => sort_method,
             :entities => entities,
             :status => repo_status_initializer).save

    @user.repos << Repo.last

DELETE FROM "repos" WHERE "repos"."id" = ?  [["id", 15]]
---
  def delete_repo

    user_info = request.body.read

    user_info = JSON.parse(user_info)

    user_info = user_info["url"].split("_")

    repo_name = user_info[1]

    re = find_repo repo_name
    Repo.find(re.id).destroy

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "nmsl"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "repos_users" ON "users"."id" = "repos_users"."user_id" WHERE "repos_users"."repo_id" = ? AND "users"."id" = ? LIMIT ?  [["repo_id", 7], ["id", 4], ["LIMIT", 1]]
---
  def share_repo

    user_info = request.body.read

    user_info = JSON.parse(user_info)

    users = user_info["users"].split
    user_repo = user_info["url"].split("_")
    username = user_repo[0]
    repo_name = user_repo[1]

    puts username
    puts users.to_s
    puts repo_name

    success_s = ""
    fail_s = ""

    re = find_repo repo_name

    users.each do |name|

      if User.find_by_username(name).blank?
        fail_s += name + " "
      else
        success_s += name + " "

        if re.users.include?(User.find_by_username(name))

SELECT "users".* FROM "users" INNER JOIN "repos_users" ON "users"."id" = "repos_users"."user_id" WHERE "repos_users"."repo_id" = ?  [["repo_id", 8]]
---
  def get_repo_user

    user_info = request.body.read

    user_info = JSON.parse(user_info)

    user_info = user_info["url"].split("_")

    repo_name = user_info[1]

    users = ""

    re = find_repo repo_name
    re.users.each do |u|

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "yuan"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "yuan"], ["password", "999"], ["created_at", "2019-04-10 17:49:06.193860"], ["updated_at", "2019-04-10 17:49:06.193860"]]
---
  def create

    account_info = request.body.read
    account_info = JSON.parse(account_info)
    username = account_info["username"]
    password = account_info["password"]

    status = true

    if User.where(:username => username).blank?
        User.new(:username => username, :password=>password).save

SELECT "users".* FROM "users" WHERE "users"."username" = ? AND "users"."password" = ?  [["username", "iii"], ["password", "123"]]
---
  def validate

    account_info = request.body.read
    account_info = JSON.parse(account_info)
    username = account_info["username"]
    password = account_info["password"]

    if User.where(["username = ? and password = ?", username, password]).blank?

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "nmsl"], ["LIMIT", 1]]
---
    def set_user

      @user = User.find_by_username(params[:username])